![texto alternativo](https://)El formato de entrega será subir a u-cursos un Jupyter notebook laboratorio2.ipynb, que se debe ejecutar sin errores desde la primera celda a la última. Todo el código debe estar en el mismo notebook, el código debe estar comentado y el notebook debe estar escrito en forma de informe técnico, escribiendo una celda markdown antes de cada celda de código.

# LABORATORIO 2: ANÁLISIS EXPLORATORIO DE LOS DATOS
Es uno de los primeros pasos en un proyecto de minería de datos luego de la comprensión del problema/negocio y la selección de los datos. Es de suma importancia ya que permite corroborar hipótesis, detectar outliers, estructurar el modelamiento de los datos, resolver problemas de los datos e iterar en el entendimiento del problema.

Algunos de los principales desafíos son como visualizar datos no estructurados (como texto), visualizar estructuras de datos complejas como redes y visualizar conjunto de datos de alta dimensionalidad.

## 1. Pandas
"**Pandas** is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language." 

Recuperado de [https://pandas.pydata.org/](https://pandas.pydata.org/) en Octubre de 2018.

Ejemplo en: [Github/guipsamora/pandas_exercises](https://github.com/guipsamora/pandas_exercises/blob/master/06_Stats/US_Baby_Names/Exercises_with_solutions.ipynb)

In [0]:
# 1. Importar las librerias
import pandas as pd

# 2. Importar los datos
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [0]:
# 3. Ver los datos
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [0]:
# 4. Eliminar 'Unnamed: 0' y 'Id'
del baby_names['Unnamed: 0']
del baby_names['Id']

baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [0]:
# Primera fila del dataframe
baby_names.iloc[0]

Name      Emma
Year      2004
Gender       F
State       AK
Count       62
Name: 0, dtype: object

In [0]:
# Primera columna
baby_names.iloc[:,0].head(5)

0       Emma
1    Madison
2     Hannah
3      Grace
4      Emily
Name: Name, dtype: object

In [0]:
# 5. Algunas operaciones: contar hombres y mujeres en el dataset
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [0]:
#Conteo por atributo
baby_names.groupby(['Gender','Year']).size()

Gender  Year
F       2004    48083
        2005    49196
        2006    50851
        2007    52234
        2008    52568
        2009    51987
        2010    51084
        2011    50651
        2012    50722
        2013    50440
        2014    51030
M       2004    38337
        2005    39298
        2006    40952
        2007    42098
        2008    42402
        2009    42622
        2010    42223
        2011    41894
        2012    42302
        2013    42303
        2014    43118
dtype: int64

In [0]:
#Summary
pd.set_option('display.float_format', lambda x: '%.1f' % x) #Desactivar notación científica
baby_names['Year'].describe()

count   1016395.0
mean       2009.1
std           3.1
min        2004.0
25%        2006.0
50%        2009.0
75%        2012.0
max        2014.0
Name: Year, dtype: float64

In [0]:
#Seleccionar con condiciones
baby_names.loc[(baby_names['Year'] == 2012) & (baby_names['State'] == "AK") & (baby_names['Name'] == "Sebastian")]

      Unnamed: 0     Id       Name  Year Gender State  Count
4313       25985  25986  Sebastian  2012      M    AK     13

In [0]:
# Buscar nombres que sean unisex
M_names = baby_names.loc[baby_names['Gender'] == "M"]['Name'].values.tolist()
baby_names.loc[(baby_names['Gender'] == "F") & (baby_names['Name'].values.tolist() in M_names)]
##### 3 DÉCIMAS EXTRAS EN EL LAB AL GRUPO QUE LOGRE ENCONTRAR EL RESULTADO SÓLO A TRAVES DE BÚSQUEDAS POR CONDICIÓN

Empty DataFrame
Columns: [Name, Year, Gender, State, Count]
Index: []

In [0]:
# Buscar nombres que sean unisex (ahora si)
import timeit
start = timeit.default_timer()
# Buscar nombres de Mujer y Hombre
F_names = baby_names['Name'].loc[(baby_names['Gender'] == "F")]
M_names = baby_names['Name'].loc[(baby_names['Gender'] == "M")]
FM_names = [x for x in list(set(F_names.values.tolist())) if x in list(set(M_names.values.tolist()))]
stop = timeit.default_timer()
print('Time (s): ', stop - start) 
print(FM_names)

('Time: ', 192.13603496551514)
['Rory', 'Itzae', 'Casey', 'Sandy', 'Merlin', 'Kailey', 'Yuki', 'Cole', 'Dominique', 'Quincy', 'Unnamed', 'Kaydence', 'Gentry', 'Kameron', 'Emerson', 'Indigo', 'Kayce', 'Briar', 'Braedyn', 'Dempsey', 'Reese', 'Braylin', 'Quinn', 'Jules', 'Kaegan', 'Nazareth', 'Kendal', 'Brooks', 'Seth', 'Caiden', 'Aspen', 'Embry', 'Josiah', 'Kodi', 'Kody', 'Paul', 'Gianni', 'Raleigh', 'Ashlan', 'Alexander', 'Natasha', 'Chloe', 'Matthew', 'Cody', 'Angela', 'Kimani', 'Holly', 'Imari', 'Asa', 'Lynn', 'Sofia', 'Mckenna', 'Skylan', 'Skylar', 'Daryn', 'Mylan', 'Issa', 'Saige', 'Rio', 'Mackenzie', 'Anderson', 'John', 'Rayne', 'Lindsey', 'Laura', 'Layne', 'Carlos', 'William', 'Jadyn', 'Remington', 'Harrison', 'Campbell', 'Zailyn', 'Skye', 'Courtney', 'Amelia', 'Hollis', 'Terren', 'Gavin', 'Gurnoor', 'Oscar', 'Steven', 'Basil', 'Noel', 'Abby', 'Royce', 'Remy', 'Alik', 'Alix', 'Remi', 'Kadence', 'Cayden', 'Amber', 'Valentine', 'Emari', 'Amauri', 'Toni', 'Yarel', 'Tony', 'Jose', 'Nolan', 'Alijah', 'Tracy', 'Charley', 'Samari', 'Charles', 'Kayleigh', 'Brett', 'Mikah', 'Kamalei', 'Indiana', 'Wen', 'Lyle', 'Kali', 'Tal', 'Tam', 'Tai', 'Kevin', 'Eliyah', 'Cruz', 'Francis', 'True', 'Emma', 'David', 'Boston', 'Travis', 'Joni', 'August', 'Henley', 'Braeden', 'Irie', 'Brian', 'Sage', 'Yoltzin', 'Layla', 'Kensley', 'Arshdeep', 'Eliah', 'Teagan', 'Cypress', 'Whitney', 'Ezrah', 'Jace', 'Kaitlynn', 'Kris', 'Elizabeth', 'Joy', 'Valerie', 'Raylin', 'Brodie', 'Royal', 'Patrick', 'Jourdan', 'Seven', 'Allison', 'Weston', 'Sky', 'Brecken', 'Kenyatta', 'Michal', 'Santana', 'Lee', 'Madeline', 'Wisdom', 'Jaylynn', 'Demari', 'Skyler', 'Syncere', 'Chidera', 'Payten', 'Jireh', 'Kamron', 'Rion', 'Hallie', 'Daniel', 'Colby', 'Jeremy', 'Caidyn', 'Perry', 'Brandon', 'Kristian', 'Sloan', 'Finley', 'Stevie', 'Wrigley', 'Rowyn', 'Jeriah', 'Alex', 'Lyric', 'Lyrik', 'Blakely', 'Kingsley', 'Ollie', 'Noam', 'Toby', 'Jayce', 'Tobi', 'Leyton', 'Arlin', 'Jordyn', 'Charlie', 'Justine', 'Ryen', 'Jared', 'Lacey', 'Katelyn', 'Nery', 'Neri', 'Nana', 'Benjamin', 'Dasani', 'Kimi', 'Graycen', 'Brody', 'Michael', 'Elliot', 'Savannah', 'Bryn', 'Ngawang', 'Cade', 'Dior', 'Blaize', 'Jaylyn', 'Sunny', 'Serenity', 'Jaydyn', 'Shiloh', 'Hannah', 'Haidyn', 'Isa', 'Jessica', 'Teagen', 'Amarie', 'Amarii', 'Han', 'Lilly', 'Sequoia', 'Reed', 'Dalton', 'Jailyn', 'Honor', 'Jason', 'Teddy', 'Macy', 'Tristian', 'Scout', 'Ashlyn', 'Michel', 'Zuriel', 'Shamari', 'Armoni', 'Shayla', 'Alisha', 'Sol', 'Kara', 'Landon', 'Brandy', 'Ahmari', 'Wynn', 'Mallory', 'Dakota', 'Andi', 'Riki', 'Andy', 'Brady', 'Antonio', 'Katie', 'Shay', 'Ivan', 'Shae', 'Shai', 'Sierra', 'Khamari', 'Neftali', 'Nehemiah', 'Neftaly', 'Lonnie', 'Jia', 'Kolby', 'Alden', 'Holland', 'Vaughn', 'Rowen', 'Alaa', 'Peyton', 'Freedom', 'Elisha', 'Caitlyn', 'Kori', 'Neko', 'Clayton', 'Robin', 'Nathan', 'Hudsyn', 'Ryan', 'Carsyn', 'Marlowe', 'Denim', 'Denis', 'Deniz', 'Shayne', 'Brooke', 'Haven', 'Sai', 'Arlen', 'Sam', 'Arley', 'Mills', 'Manjot', 'Karsen', 'Kamrin', 'Miguel', 'Aiden', 'Jesus', 'Rani', 'Brennen', 'Iran', 'Jasiah', 'Jaycee', 'Zaire', 'Zamari', 'Finn', 'Cashmere', 'Paris', 'Brittany', 'Giovanni', 'River', 'Ryland', 'Linden', 'Ariana', 'Maika', 'Kawena', 'Rhyan', 'Lukas', 'Piper', 'Danny', 'Grey', 'Carmen', 'Kristen', 'Julia', 'Jayden', 'Hayden', 'Flynn', 'Darius', 'Mykah', 'Yael', 'Conley', 'Khamani', 'Montana', 'Eden', 'Azariah', 'Karsyn', 'Alexi', 'Nijah', 'Chelsea', 'Jessy', 'Jessi', 'Jesse', 'Iman', 'Khari', 'Hendrix', 'Micaiah', 'Keaton', 'Collins', 'Avery', 'Shea', 'Breanna', 'Kinsler', 'Kaydin', 'Brentley', 'Rowan', 'Renee', 'Dylan', 'Ocean', 'Jayleen', 'Marissa', 'Maison', 'Ashby', 'Drew', 'Evan', 'Kyrie', 'Yareth', 'Arrow', 'Dezi', 'Aubrey', 'Cooper', 'Tracey', 'Finnley', 'Jasmin', 'Selena', 'Christian', 'Kashmere', 'Kamren', 'Luca', 'Ayden', 'Adair', 'Aidan', 'Kayden', 'Anna', 'Layton', 'Jackson', 'Osiris', 'Kerry', 'Reece', 'Raylen', 'Ming', 'Kacey', 'Uriyah', 'Torrey', 'Olamide', 'Tru', 'Cameryn', 'Robbie', 'Kirsten', 'Gray', 'Tucker', 'Ari', 'Mykel', 'Presley', 'Brighton', 'Jessie', 'Roni', 'Tenzin', 'Jaspreet', 'Kellen', 'Kelley', 'Adel', 'Parker', 'Sincere', 'George', 'Reilly', 'Eastyn', 'Rivers', 'Legacy', 'Isaac', 'Adler', 'Shalom', 'Yihan', 'Taylen', 'Tayler', 'Rebel', 'Justus', 'Shia', 'Jai', 'Jae', 'Yuval', 'Kirby', 'Grace', 'Jamari', 'Aaron', 'Barrett', 'Eliot', 'Caroline', 'Journey', 'Camden', 'Callan', 'Erin', 'Eric', 'Landry', 'Ever', 'Diamond', 'Kaiden', 'Malachi', 'Cali', 'Yuri', 'Keona', 'Cree', 'Aydan', 'Sacha', 'Tylar', 'Melanie', 'Kenneth', 'Reagan', 'Israel', 'Arden', 'Kamil', 'Kaitlyn', 'Rylan', 'Sterling', 'Jayla', 'Adriel', 'Adrien', 'Mark', 'Mary', 'Rayaan', 'Amaree', 'Taj', 'Storm', 'Adi', 'Abriel', 'Carlin', 'Aziah', 'Myles', 'Judah', 'Kadyn', 'Jake', 'Fernando', 'Naveen', 'Unknown', 'Lian', 'Ella', 'Omari', 'Bentley', 'Sascha', 'Bentlee', 'Bryce', 'Alexes', 'Kellan', 'Tommie', 'Joan', 'Clarke', 'Connor', 'Bless', 'Justyce', 'Keelyn', 'Nour', 'Matisse', 'Adonai', 'Atlas', 'Bodhi', 'Dominik', 'Rilyn', 'Dominic', 'Blayke', 'Taylin', 'Liam', 'Kamden', 'Emersyn', 'Everett', 'Lexus', 'Kaleb', 'Jeremiah', 'Ayan', 'Caelan', 'Schuyler', 'Braylyn', 'Kimberly', 'Abigayle', 'Rhys', 'Braden', 'Gabrielle', 'Lennox', 'Lennon', 'Evyn', 'Jael', 'Cristian', 'Michelle', 'Domonique', 'Laramie', 'Cheyenne', 'Blair', 'Isabella', 'Isabelle', 'Keegan', 'Ayomide', 'Royale', 'Bralyn', 'Allie', 'Faith', 'Aidyn', 'Akira', 'Dennis', 'Tylee', 'Tyler', 'Billy', 'Alexandria', 'Jaydenn', 'Semaj', 'Taylor', 'Catherine', 'Lior', 'Eli', 'Ryley', 'Rylee', 'Ely', 'Rylen', 'Makena', 'Sutton', 'Adrian', 'Jaydin', 'Tate', 'Zen', 'Aviv', 'Hayes', 'Tristin', 'An', 'Gracie', 'Crimson', 'Noe', 'Noa', 'Riyan', 'Jaime', 'Xavier', 'Izel', 'Cameran', 'Armani', 'Blake', 'Emory', 'Rayan', 'Arshia', 'Memphis', 'Claire', 'Jaedyn', 'Zyaire', 'Kamani', 'Alexiz', 'Alexis', 'Alexia', 'Joey', 'Nicky', 'Sina', 'Kodie', 'Kylin', 'Kylie', 'Madden', 'Ekam', 'Alexa', 'Messiah', 'Atley', 'Atlee', 'Shane', 'Aryan', 'Channing', 'Kelby', 'Richard', 'Kamdyn', 'Ainsley', 'Billie', 'Makell', 'Dyllan', 'Santos', 'Bowie', 'Jackie', 'Devine', 'Callie', 'Lou', 'Haylee', 'Haylen', 'Ann', 'Anh', 'Hayley', 'Saba', 'Brylee', 'Brylen', 'Porter', 'Bo', 'Kooper', 'Kemani', 'Damoni', 'Beckett', 'Rumi', 'Kailen', 'Mason', 'Larkin', 'Kayla', 'Dayton', 'Devan', 'Cassidy', 'Lake', 'Madelyn', 'Kaimana', 'Makana', 'Damien', 'Aiman', 'Cierra', 'Simcha', 'Aimar', 'Rylin', 'Bailey', 'Rylie', 'Douglas', 'Jaydn', 'Thomas', 'Aven', 'Camdyn', 'Yannis', 'Lamar', 'Tristen', 'Hailey', 'Hailee', 'Jacob', 'Shannon', 'Breslin', 'Phoenix', 'Jacy', 'Kai', 'Josey', 'Jack', 'Lucas', 'Arya', 'Sonam', 'Ali', 'Aly', 'Monroe', 'Blue', 'Blaine', 'Milan', 'Destiny', 'Jalyn', 'Amere', 'Tamari', 'Laine', 'Charleston', 'Kyler', 'Zoey', 'Kylen', 'Colin', 'Kylee', 'Trinidad', 'Kiernan', 'Devon', 'Loren', 'Trenton', 'Payden', 'Tamar', 'Amani', 'Kymani', 'Cortney', 'Kalen', 'Sydney', 'Dusty', 'Gunnar', 'Lenox', 'Jaidan', 'Jeffrey', 'Britton', 'Tatum', 'Griffin', 'Gurjot', 'Lupe', 'Lucca', 'Ary', 'Ara', 'Garrett', 'Name', 'Makenzie', 'Marlo', 'Corey', 'Cameron', 'Marley', 'Dallas', 'Niko', 'Shawn', 'Jean', 'Kayson', 'Golden', 'Kailan', 'Conner', 'Teegan', 'Kyndall', 'Andrew', 'Andrea', 'Agam', 'Shelby', 'Maddox', 'Alana', 'Ronnie', 'Ridley', 'Easton', 'Abrar', 'Kaylee', 'Kaylen', 'Collier', 'Micha', 'Orion', 'Alyssa', 'Jaydan', 'Quincey', 'Langston', 'Jade', 'Jada', 'Tristan', 'Kylan', 'Lexington', 'Kaelan', 'Leslie', 'Nasiah', 'Rain', 'Sevyn', 'Kyle', 'Gage', 'Lux', 'Luz', 'Camron', 'Josie', 'Jude', 'Anmol', 'Grant', 'Levi', 'Corrie', 'Torrance', 'Murphy', 'Oluwademilade', 'Frankie', 'Stephen', 'Jonah', 'Kylar', 'Amir', 'Angel', 'Elan', 'Lael', 'Riley', 'Ty', 'Amari', 'Amare', 'Kieran', 'Carrington', 'Brianna', 'Mckinley', 'Jazz', 'Rene', 'Rilee', 'Margaret', 'London', 'Mel', 'Kaelin', 'Dru', 'Berkley', 'Stacey', 'Kalin', 'Jaiden', 'Autumn', 'Kemari', 'Greyson', 'Walker', 'Aliyah', 'Avi', 'Ava', 'Saylor', 'Mendy', 'Corin', 'Keylen', 'Kaena', 'Van', 'Winter', 'Darby', 'Sebastian', 'Sivan', 'Denver', 'Ellis', 'Jezreel', 'Trystan', 'Devin', 'Jameson', 'Cory', 'Kennedy', 'Zachary', 'Jermiah', 'Stacy', 'Aaliyah', 'Kelly', 'Surya', 'Sophia', 'Dillon', 'Karter', 'Trinity', 'Jaelin', 'Elijah', 'Jaydee', 'Eh', 'Evann', 'Briley', 'Ethan', 'Genesis', 'Jacky', 'Justin', 'Lakota', 'Austyn', 'Airam', 'Ryann', 'Kona', 'Egypt', 'Brayden', 'Paxton', 'Marion', 'Asani', 'Terry', 'Isaiah', 'Braylen', 'Dani', 'Dana', 'Haiden', 'Sidney', 'Collin', 'Chayse', 'Rachel', 'Charly', 'Ira', 'Elliott', 'Zander', 'Samantha', 'Christopher', 'Mckenzie', 'Robert', 'Harley', 'Harlem', 'Bradley', 'Merritt', 'Wiley', 'Troy', 'Davis', 'Ezra', 'Megan', 'Bennett', 'Delaney', 'Lane', 'Damari', 'Ashtyn', 'Asiah', 'Nikola', 'Jaidyn', 'Harper', 'Angelina', 'Lucky', 'Chaise', 'Toryn', 'Johnnie', 'Olivia', 'Rian', 'Jorden', 'Jasani', 'Jennifer', 'Nico', 'Nihal', 'Johnathon', 'Katherine', 'Savanna', 'Nicola', 'Nicole', 'Graysen', 'Yi', 'Dayan', 'Yu', 'Emery', 'Oluwanifemi', 'Carsen', 'Preston', 'Mycah', 'Colton', 'Brooklynn', 'Maven', 'Kinsley', 'Maysen', 'Sammy', 'Lincoln', 'Dominque', 'Caleb', 'Tristyn', 'Sheridan', 'Jensen', 'Kaedyn', 'Britten', 'Regan', 'Lillian', 'Christen', 'Austen', 'Emry', 'Zoe', 'July', 'Reign', 'Brooklyn', 'Trevor', 'Marlow', 'Rhiley', 'Luis', 'Jaylan', 'Gabrial', 'Alexys', 'Jalen', 'Hunter', 'Marcus', 'Shilo', 'Anay', 'Bayan', 'Adam', 'Ashlee', 'Victoria', 'Sawyer', 'Dakotah', 'Mika', 'Miko', 'Heaven', 'Masyn', 'Lydia', 'Jonathon', 'Child', 'Harlan', 'Kirin', 'Erika', 'Kendra', 'Hanna', 'Rooney', 'Leah', 'Elie', 'Baby', 'Henry', 'Wren', 'Khali', 'Zi', 'Damani', 'Ashten', 'Koi', 'Arin', 'Juno', 'Jadin', 'Tessa', 'Sara', 'Jerry', 'Nathaniel', 'Jordan', 'Mariah', 'Marlin', 'Emanuel', 'Kameryn', 'Maxwell', 'Gabriele', 'Gabriell', 'Puneet', 'Addison', 'Kelsey', 'Nakia', 'Noah', 'Crosby', 'Dylann', 'Jaxon', 'Nevaeh', 'Rebecca', 'Jelani', 'Kaylin', 'Dereon', 'Brixton', 'Joelle', 'Mina', 'Jamison', 'Jasmine', 'Paige', 'Avry', 'Lauryn', 'Loghan', 'Jalynn', 'Raven', 'Zephaniah', 'Chevy', 'Londen', 'Jalani', 'Hadley', 'Kaya', 'Brittan', 'Azriel', 'Zyan', 'Spencer', 'Chance', 'Adama', 'Alexandra', 'Void', 'Elia', 'Braxton', 'Aria', 'Arie', 'Aris', 'Taryn', 'James', 'Cedar', 'Kenley', 'Bristol', 'Hadyn', 'Amrit', 'Sarah', 'Xander', 'Ian', 'Krishna', 'Gabriel', 'Jaylen', 'Shaya', 'Shaye', 'Tegan', 'Camari', 'Madison', 'Haleigh', 'Zixuan', 'Amel', 'Abyan', 'Keagan', 'Ashtin', 'Sukhman', 'Kyree', 'Jaydeen', 'Hudson', 'Abigail', 'Carson', 'Aaryn', 'Aarya', 'Emily', 'Mayson', 'Brailyn', 'Tiffany', 'Nova', 'Rei', 'Amanda', 'Harnoor', 'Ariel', 'Aries', 'Nyjah', 'Indy', 'Asher', 'Owen', 'Kanon', 'Mia', 'Natalie', 'Myka', 'Wesley', 'Infant', 'Oluwadarasimi', 'Zakaria', 'Julian', 'Amen', 'Sammie', 'Ameya', 'Palmer', 'Taytum', 'Luke', 'Tori', 'Brennan', 'Tory', 'Merrick', 'Audrey', 'Luka', 'Korbyn', 'Bentlie', 'Talyn', 'Harlow', 'Denali', 'Lauren', 'Chandler', 'Brantlee', 'Brantley', 'Quinlan', 'Jodie', 'Dream', 'Karson', 'Blaise', 'Jett', 'Kasey', 'Mana', 'Lily', 'Zephyr', 'Zaylin', 'Auden', 'Jordon', 'Camren', 'Jamie', 'Marvel', 'Haley', 'Jaylin', 'Halen', 'Dara', 'Majesty', 'Jayme', 'Noor', 'Soren', 'Jaziah', 'Cyan', 'Joshua', 'Carly', 'Kathryn', 'Chase', 'Mica', 'Baylor', 'Cadyn', 'Grayson', 'Guadalupe', 'Dillan', 'Erica', 'Wyatt', 'Ryker', 'Aden', 'Kinnick', 'Darian', 'Kiran', 'Dakoda', 'Logan', 'Sean', 'Beau', 'Sami', 'Arian', 'Sehaj', 'Karol', 'Jacey', 'Joseph', 'Kenzie', 'Cadence', 'Samuel', 'Laken', 'Zyon', 'Reid', 'Dorian', 'Wylie', 'Sinai', 'Jadan', 'Bryson', 'Jordin', 'Daylen', 'Reegan', 'Uriah', 'Daelyn', 'Micah', 'Sasha', 'Salem', 'Kobi', 'Oakley', 'Danielle', 'Jasiyah', 'Samar', 'Carter', 'Miller', 'Devyn', 'Kree', 'Jaelyn', 'Kamryn', 'Rosario', 'Kendell', 'Kalani', 'Justice', 'Kamauri', 'Alize', 'Leighton', 'Landyn', 'Jasper', 'Tennyson', 'Karma', 'Payton', 'Anthony', 'Bryan', 'Ashton', 'Austin', 'Natividad', 'Ellington', 'Zion', 'Laakea', 'Kendel', 'Notnamed', 'Tanner', 'Jaeden', 'Khristian', 'Molly', 'Lynden', 'Lakin', 'Makayla', 'Caden', 'Onyx', 'Ashley', 'Cai', 'Summer', 'Ciel', 'Dariel', 'Keelan', 'Alika', 'Unique', 'Lawson', 'Kamari', 'Divine', 'Tien', 'Ryder', 'Meredith', 'Dannie', 'Ellison', 'Bergen', 'Diego', 'Jody', 'Micheal', 'Kaysen', 'Kaden', 'Legend', 'Sullivan', 'Nikita', 'Gracen', 'Maggie', 'Destin', 'Camryn', 'Timothy', 'Emilee', 'Kaidyn', 'Hope', 'Alma', 'Dawson', 'Daylin', 'Nicholas', 'Bayley', 'Landen', 'Baylee', 'Zuri', 'Dustin', 'Jonathan', 'Kendall', 'Morgan', 'Juan', 'Ami', 'Ivory', 'Ramsey', 'Britain', 'Jenna', 'Braelyn', 'Ricky', 'Marin', 'Desi', 'Maria', 'Jaden', 'Payson', 'Adison']

In [0]:
baby_names.loc[baby_names['Name'] == "Casey"].head(10)

        Name  Year Gender State  Count
2801   Casey  2005      M    AK      5
3479   Casey  2008      M    AK      5
5347   Casey  2004      F    AL     12
6226   Casey  2005      F    AL     11
8288   Casey  2007      F    AL      6
8904   Casey  2008      F    AL     12
10075  Casey  2009      F    AL      7
10969  Casey  2010      F    AL      7
12087  Casey  2011      F    AL      5
14488  Casey  2014      F    AL      8

## 2. Librerias para visualización de datos en Python
Top 5 librerias para visualización de datos en Python: [Analytics India Magazine](https://www.analyticsindiamag.com/top-5-best-data-visualisation-libraries-in-python/)

## 3. Ejemplos y documentación

1. Ejemplos para Matplotlib, Seaborn, Altair, Plotly y Bokeh en: [Charts in Colaboratory](https://colab.research.google.com/notebooks/charts.ipynb#scrollTo=hFCg8XrdO4xj)

2. Una de las mejores integraciones para visualizar grafos se obtiene con la libreria [Networkx](https://networkx.github.io/documentation/stable/auto_examples/index.html) y [Holoviews](http://holoviews.org/getting_started/Tabular_Datasets.html)

3. Parallel Coordinates con Plotly: [Plotly Parallel Coord](https://plot.ly/python/parallel-coordinates-plot/) (Advertencia: esta libreria requiere entender su uso offline)

## 4. Tareas de investigación (2 ptos)

### Variables visuales (1,5 ptos)
#### 4.1 Investigue que son las variables visuales y elabore un breve resumen del significado de este concepto.
#### 4.2 Describalas brevemente cada una de las variables visuales.
#### 4.3 Describa la relación entre variables visuales y los atributos de un conjunto de datos en el desarrollo de una visualización.
#### 4.4 Busque una imagen en internet en el que se haya hecho un mal uso de alguna de las variables visuales que usted investigo y reportela justificando porque fue mal elaborada dicha visualización (además inserte el link a la visualización).

### Visualización de datos multidimensional (0,5 ptos)
#### 4.5 Investigue sobre al menos 2 técnicas de datos para la visualización de datos multidimensional. Reportelos con una breve descripción (puede utilizar imágenes si considera que apoyan la explicación de la visualización).

## 5. Ejercicio Laboratorio (4 ptos)


---
Considere el problema que enfrenta una entidad financiera que tiene altas tasas de fuga voluntaria. Esta institución no tiene claro cuál es el perfil característico que tienen los clientes fugitivos ni cuáles son las razones por las cuales estos se fugan.

El gerente general le ha pedido **definir el patrón característico de los clientes fugitivos y de los clientes no fugitivos con el objetivo de definir una serie de políticas comerciales** que permitan retener a estos potenciales clientes fugitivos.

#### Entregables:

5.1 Muestre al menos 3 gráficos que muestren diferencias entre el grupo que se fuga y el que no (3 ptos)

5.2 Implemente al menos uno de los gráficos para la visualización de datos multidimensionales que investigo en la parte anterior. La idea es que este gráfico resuma los resultados obtenidos del proceso de análisis exploratorio de los datos (i.e, muestra en una visualización las diferencias en los atributos que caracterizan ambas poblaciones) (1 pto)

---
Variable | Descripción
------------- | -------------
1. ID | Identificador del cliente
2. Genero | Genero del cliente
3. Renta | Renta en pesos
4. Edad | Edad en años
5. NIV_Educ | Nivel educacional
6. E_Civil | Estado civil
7. COD_OfI | Código de la oficina 
8. Ciudad | Ciudad de la oficina
9. D_Marzo | Deuda de Marzo
10. D_Abril | Deuda de Abril 
11. D_Mayo | Deuda de Mayo
12. D_Junio | Deuda de Junio 
13. D_Julio | Deuda de Julio 
14. D_Agosto | Deuda de Agosto 
15. D_Septiembre | Deuda de Septiembre
16. M_Moroso | Meses en Mora
17. Monto | Monto preaprobado 
18. Seguro | Seguro de gravamen 
19. Fuga | Variable objetivo

In [0]:
!pip install xlrd

Collecting xlrd
  Downloading https://files.pythonhosted.org/packages/07/e6/e95c4eec6221bfd8528bcc4ea252a850bffcc4be88ebc367e23a1a84b0bb/xlrd-1.1.0-py2.py3-none-any.whl (108kB)
    100% |████████████████████████████████| 112kB 2.6MB/s
Installing collected packages: xlrd
Successfully installed xlrd-1.1.0

In [0]:
from google.colab import files
uploaded = files.upload()

Saving Fuga_Bancos.xlsx to Fuga_Bancos.xlsx

In [0]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile

data = pd.read_excel('Fuga_Bancos.xlsx')
data.head(5)

,GENERO,RENTA,EDAD,NIV_EDUC,E_CIVIL,CIUDAD,COD_OFI,D_Marzo,D_Abril,D_Mayo,D_Junio,D_Julio,D_Agosto,D_Septiembre,M_MOROSO,MONTO,SEGURO,FUGA
0,M,746476,39.0,MED,CAS,LOS ANGELES,68,0,38292,0,434357,1766,9110,340,2,2000000,NO,NO FUGA
1,F,11901,49.0,MED,VIU,SANTIAGO,16,0,0,0,0,48,0,0,1,7500000,SI,NO FUGA
2,M,1651421,39.0,TEC,CAS,ANTOFAGASTA,90,0,604169,0,0,323,26489,2925,1,8000000,NO,NO FUGA
3,F,638969,36.0,UNV,CAS,SANTIAGO,85,0,5125,0,198998,94,0,105,1,2600000,NO,NO FUGA
4,M,860113,44.0,TEC,CAS,SANTIAGO,45,0,11946,0,73959,149,0,272,1,6400000,NO,NO FUGA